brew "tree" # Displays directory structures as a tree
brew "watch" # Runs a command repeatedly and shows updated output
brew "trash" # Moves files to the macOS Trash from the command line
brew "openssl" # Provides TLS and cryptography libraries and tools
brew "telnet" # Provides the Telnet client for testing raw TCP connections

brew "vim" # Installs the Vim terminal text editor
brew "neovim" # Installs the Neovim extended text editor
brew "curl" # Transfers data with URLs from the command line
brew "wget" # Downloads files from HTTP, HTTPS, and FTP sources
brew "git" # Provides distributed version control
brew "git-delta" # Installs Delta, a syntax-highlighting pager for Git and diff output
brew "lazygit" # Provides a terminal UI for common Git commands
cask "lazyworktree" # Provides a terminal UI for managing Git worktrees
brew "fish" # Installs the Fish interactive shell
brew "jq" # Parses and transforms JSON from the command line
brew "ripgrep" # Fast recursive search tool
brew "yq" # Parses and transforms YAML from the command line

brew "starship" # Provides a fast, customizable cross-shell prompt
cask "font-caskaydia-mono-nerd-font" # Installs Caskaydia Mono Nerd Font with developer icons
cask "font-jetbrains-mono" # Installs JetBrains Mono programming font
cask "font-jetbrains-mono-nerd-font" # Installs JetBrains Mono Nerd Font with developer icons
cask "font-fira-code-nerd-font" # Installs Fira Code Nerd Font with developer icons

brew "go" # Installs the Go programming language runtime
brew "node" # Installs the Node.js JavaScript runtime and npm
brew "pnpm" # Installs the fast, disk-efficient Node.js package manager
brew "wrk" # Installs an HTTP benchmarking tool

brew "pass" # Stores and retrieves GPG-encrypted passwords via the Unix password manager
brew "pipx" # Installs Python CLI tools in isolated virtual environments
brew "mkdocs" # Generates static documentation sites from Markdown
brew "nyancat" # Displays the animated Nyan Cat in the terminal

brew "mas" # Installs a command-line interface for the Mac App Store

cask "dotnet-sdk" # Installs the .NET SDK for building and running .NET apps
cask "zed" # Installs the Zed high-performance code editor

brew "azure-cli" # Installs Microsoft's Azure command-line interface

brew "kubernetes-cli" # Installs kubectl for managing Kubernetes clusters
brew "kubectx" # Switches quickly between Kubernetes contexts and namespaces
brew "kubelogin" # Provides authentication helpers for Kubernetes clusters
brew "kind" # Runs local Kubernetes clusters in Docker containers
brew "helm" # Installs the Kubernetes package manager
brew "helmfile" # Manages declarative Helm chart releases
brew "k9s" # Provides a terminal UI for managing Kubernetes clusters

brew "gh" # Installs the GitHub command-line interface

tap "go-task/tap"
brew "go-task/tap/go-task" # Installs Task, a Make alternative using Taskfile.yml

cask "claude-code" # Installs Anthropic's Claude Code terminal coding assistant
cask "codex" # Installs OpenAI's Codex terminal coding assistant
cask "copilot-cli" # Installs GitHub Copilot CLI for terminal-based coding assistance

cask "rectangle" # Adds keyboard-driven window management for macOS

cask "ghostty" # Installs the Ghostty terminal emulator

cask "font-consolas-for-powerline" # Installs Consolas font with Powerline glyphs
cask "font-cascadia-code" # Installs the Cascadia Code programming font
cask "font-cascadia-code-pl" # Installs Cascadia Code PL with Powerline glyphs
